# InvalidAreaLoadSketchError Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
BuiltInFailures..::..SketchFailures..::..InvalidAreaLoadSketchError Property
BuiltInFailures..::..SketchFailures Class See Also
---
Area Load has invalid Sketch.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidAreaLoadSketchError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidAreaLoadSketchError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidAreaLoadSketchError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SketchFailures Class
Autodesk.Revit.DB Namespace